In [1]:
import pandas as pd

In [2]:
s1 = pd.Series(["anuj", "amit", "mohan"])

In [3]:
s1

0     anuj
1     amit
2    mohan
dtype: object

In [4]:
s1[0]

'anuj'

In [6]:
info = {
    "names" : ["kartik", "ravi", "mohini"],
    "ages" : [21, 10, 22],
    "salary" : [2000, 4000, 2500]
}

In [8]:
df = pd.DataFrame.from_dict(info)

In [9]:
df

    names  ages  salary
0  kartik    21    2000
1    ravi    10    4000
2  mohini    22    2500

In [10]:
df.to_csv("info.csv")

In [12]:
type(df.ages)

pandas.core.series.Series

In [13]:
df["gender"] = ["M", "M", "M"]

In [14]:
df

    names  ages  salary gender
0  kartik    21    2000      M
1    ravi    10    4000      M
2  mohini    22    2500      M

In [15]:
vals = df.values

In [16]:
vals

array([['kartik', 21, 2000, 'M'],
       ['ravi', 10, 4000, 'M'],
       ['mohini', 22, 2500, 'M']], dtype=object)

In [19]:
df.to_excel("info.xlsx", sheet_name="mohan")